tests/var/subscription-1.json

{
    "id": "sub_1Ml0NDBckVgjYj7Sos3Avbc3",
    "object": "subscription",
    "application": null,
    "application_fee_percent": null,
    "automatic_tax": {
        "enabled": false
    },
    "billing": "charge_automatically",
    "billing_cycle_anchor": 1678671626,
    "billing_thresholds": null,
    "cancel_at": null,
    "cancel_at_period_end": false,
    "canceled_at": null,
    "cancellation_details": {
        "comment": null,
        "feedback": null,
        "reason": null
    },
    "collection_method": "charge_automatically",
    "created": 1678671626,
    "currency": "usd",
    "current_period_end": 1710294026,
    "current_period_start": 1678671626,
    "customer": "cus_NUbhTAkWc7d4KP",
    "days_until_due": null,
    "default_payment_method": "pm_1Ml0NEBckVgjYj7SO20RcTFV",
    "default_source": null,
    "default_tax_rates": [],
    "description": null,
    "discount": null,
    "ended_at": null,
    "invoice_customer_balance_settings": {
        "consume_applied_balance_on_void": true
    },
    "items": {
        "object": "list",
        "data": [
            {
                "id": "si_NW2Sv2iuHkmjKr",
                "object": "subscription_item",
                "billing_thresholds": null,
                "created": 1678671627,
                "metadata": {},
                "plan": {
                    "id": "price_1Mg0NEBckVgjYj7StRJcwUEb",
                    "object": "plan",
                    "active": true,
                    "aggregate_usage": null,
                    "amount": 6999,
                    "amount_decimal": "6999",
                    "billing_scheme": "per_unit",
                    "created": 1677479988,
                    "currency": "usd",
                    "interval": "year",
                    "interval_count": 1,
                    "livemode": false,
                    "metadata": {},
                    "nickname": null,
                    "product": "prod_Lg9guWOikYWnGQ",
                    "tiers": null,
                    "tiers_mode": null,
                    "transform_usage": null,
                    "trial_period_days": null,
                    "usage_type": "licensed"
                },
                "price": {
                    "id": "price_1Mg0NEBckVgjYj7StRJcwUEb",
                    "object": "price",
                    "active": true,
                    "billing_scheme": "per_unit",
                    "created": 1677479988,
                    "currency": "usd",
                    "custom_unit_amount": null,
                    "livemode": false,
                    "lookup_key": null,
                    "metadata": {},
                    "nickname": null,
                    "product": "prod_Lg9guWOikYWnGQ",
                    "recurring": {
                        "aggregate_usage": null,
                        "interval": "year",
                        "interval_count": 1,
                        "trial_period_days": null,
                        "usage_type": "licensed"
                    },
                    "tax_behavior": "unspecified",
                    "tiers_mode": null,
                    "transform_quantity": null,
                    "type": "recurring",
                    "unit_amount": 6999,
                    "unit_amount_decimal": "6999"
                },
                "quantity": 1,
                "subscription": "sub_1Ml0NDBckVgjYj7Sos3Avbc3",
                "tax_rates": []
            }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/subscription_items?subscription=sub_1Ml0NDBckVgjYj7Sos3Avbc3"
    },
    "latest_invoice": "in_1Ml0NDBckVgjYj7S1bRUb6ZT",
    "livemode": false,
    "metadata": {},
    "next_pending_invoice_item_invoice": null,
    "on_behalf_of": null,
    "pause_collection": null,
    "payment_settings": {
        "payment_method_options": null,
        "payment_method_types": null,
        "save_default_payment_method": "on_subscription"
    },
    "pending_invoice_item_interval": null,
    "pending_setup_intent": null,
    "pending_update": null,
    "plan": {
        "id": "price_1Mg0NEBckVgjYj7StRJcwUEb",
        "object": "plan",
        "active": true,
        "aggregate_usage": null,
        "amount": 6999,
        "amount_decimal": "6999",
        "billing_scheme": "per_unit",
        "created": 1677479988,
        "currency": "usd",
        "interval": "year",
        "interval_count": 1,
        "livemode": false,
        "metadata": {},
        "nickname": null,
        "product": "prod_Lg9guWOikYWnGQ",
        "tiers": null,
        "tiers_mode": null,
        "transform_usage": null,
        "trial_period_days": null,
        "usage_type": "licensed"
    },
    "quantity": 1,
    "schedule": null,
    "start": 1678671626,
    "start_date": 1678671626,
    "status": "active",
    "tax_percent": null,
    "test_clock": null,
    "transfer_data": null,
    "trial_end": null,
    "trial_settings": {
        "end_behavior": {
            "missing_payment_method": "create_invoice"
        }
    },
    "trial_start": null
}
